Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation
Describes how the Bending Detail will represent the bar segments.
Since:
2024
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Offset
Some of the bar segments will be lengthened so there is no intersection between them.

Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Unfold
Some of the bar segments will be unfolded so there is no intersection between them.

Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Standard
The Bending Detail will represent the bar segments as they are.